{"name":"Angular - The Complete Guide (2020 Edition)","language":"English","totalTime":"45","cost":"4500","desc":"This course starts from scratch, you neither need to know Angular 1 nor Angular 2!\r\n\r\nAngular 9 simply is the latest version of Angular 2, you will learn this amazing framework from the ground up in this course!\r\n\r\nJoin the most comprehensive, popular and bestselling Angular course on Udemy and benefit not just from a proven course concept but from a huge community as well! \r\n\r\nFrom Setup to Deployment, this course covers it all! You'll learn all about Components, Directives, Services, Forms, Http Access, Authentication, Optimizing an Angular App with Modules and Offline Compilation and much more - and in the end: You'll learn how to deploy an application!\r\n\r\nBut that's not all! This course will also show you how to use the Angular CLI and feature a complete project, which allows you to practice the things learned throughout the course!\r\n\r\nAnd if you do get stuck, you benefit from an extremely fast and friendly support - both via direct messaging or discussion. You have my word! ;-)\r\n\r\nAngular is one of the most modern, performance-efficient and powerful frontend frameworks you can learn as of today. It allows you to build great web apps which offer awesome user experiences! Learn all the fundamentals you need to know to get started developing Angular applications right away.\r\n\r\nHear what my students have to say\r\n\r\nAbsolutely fantastic tutorial series. I cannot thank you enough. The quality is first class and your presentational skills are second to none. Keep up this excellent work. You really rock!﻿ - Paul Whitehouse\r\n\r\nThe instructor, Max, is very enthusiastic and engaging. He does a great job of explaining what he's doing and why rather than having students just mimic his coding. Max was also very responsive to questions. I would recommend this course and any others that he offers. Thanks, Max!\r\n\r\nAs a person new to both JavaScript and Angular 2 I found this course extremely helpful because Max does a great job of explaining all the important concepts behind the code. Max has a great teaching ability to focus on what his audience needs to understand.\r\n\r\nThis Course uses TypeScript\r\n\r\nTypeScript is the main language used by the official Angular team and the language you'll mostly see in Angular tutorials. It's a superset to JavaScript and makes writing Angular apps really easy. Using it ensures, that you will have the best possible preparation for creating Angular apps. Check out the free videos for more information.\r\n\r\nTypeScript knowledge is, however, not required - basic JavaScript knowledge is enough.\r\n\r\nWhy Angular?\r\n\r\nAngular is the next big deal. Being the successor of the overwhelmingly successful Angular.js framework it’s bound to shape the future of frontend development in a similar way. The powerful features and capabilities of Angular allow you to create complex, customizable, modern, responsive and user friendly web applications.\r\n\r\nAngular 9 simply is the latest version of the Angular framework and simply an update to Angular 2.\r\n\r\nAngular is faster than Angular 1 and offers a much more flexible and modular development approach. After taking this course you’ll be able to fully take advantage of all those features and start developing awesome applications immediately.\r\n\r\nDue to the drastic differences between Angular 1 and Angular (=Angular 9) you don’t need to know anything about Angular.js to be able to benefit from this course and build your futures projects with Angular.\r\n\r\nGet a very deep understanding of how to create Angular applications\r\n\r\nThis course will teach you all the fundamentals about modules, directives, components, databinding, routing, HTTP access and much more! We will take a lot of deep dives and each section is backed up with a real project. All examples showcase the features Angular offers and how to apply them correctly.\r\n\r\nSpecifically you will learn:\r\n\r\nWhich architecture Angular uses\r\n\r\nHow to use TypeScript to write Angular applications\r\n\r\nAll about directives and components, including the creation of custom directives/ components\r\n\r\nHow databinding works\r\n\r\nAll about routing and handling navigation\r\n\r\nWhat Pipes are and how to use them\r\n\r\nHow to access the Web (e.g. RESTful servers)\r\n\r\nWhat dependency injection is and how to use it\r\n\r\nHow to use Modules in Angular\r\n\r\nHow to optimize your (bigger) Angular Application\r\n\r\nAn introduction to NgRx and complex state management\r\n\r\nWe will build a major project in this course so that you can practice all concepts\r\n\r\nand so much more!\r\n\r\nPay once, benefit a lifetime!\r\n\r\nDon’t lose any time, gain an edge and start developing now!\r\n\r\nWho this course is for:\r\nNewcomer as well as experienced frontend developers interested in learning a modern JavaScript framework\r\nThis course is for everyone interested in learning a state-of-the-art frontend JavaScript framework\r\nTaking this course will enable you to be amongst the first to gain a very solid understanding of Angular\r\n","content":[{"name":"The Basics","time":"2","sections":["Module Introduction","How angular app starts","Using custom Components"]},{"name":"Course Projects The basics","time":"4","sections":["Project Introduction","Setting up","Creating Components"]}],"ratings":1,"studentsEnrolled":8386,"teacherName":"Destini Hoppe","_id":"926f5d35-b3a9-4913-8cb5-e6c463345617"}